//ZDOJSON1 JOB 'ACCT#','JSONIFY DEMO',                                  JOB00271
//             NOTIFY=&SYSUID,REGION=0M,
//             CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//*
//STEP1   EXEC PGM=IKJEFT01,PARM='JSONIFY httpbin.org/post'
//SYSEXEC   DD DSN=ZDO.INST.REXX,DISP=SHR
//SEQFILE   DD *
 VOLSER VOLUME_TYPE USED_CYLS  FREE_CYLS
 SP1200 3390-1           1000       2390
 SP1201 3390-1            500       2890
//SYSTSPRT  DD  SYSOUT=*
//SYSTSIN   DD  DUMMY
