//ZDOPERF1 JOB 'ACCT#','PERF COLLEC',                                   JOB00271
//             NOTIFY=&SYSUID,REGION=0M,
//             CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1)
//*
//*
//STEP1   EXEC PGM=IKJEFT01,PARM='%PERFMON'
//SYSEXEC   DD DSN=ZDO.INST.REXX,DISP=SHR
//PERFDATA  DD DSN=&&PRFDATA,DISP=(,CATLG,DELETE)
//SYSTSPRT  DD  SYSOUT=*
//SYSTSIN   DD  DUMMY
//*
//STEPL   EXEC PGM=IEBGENER
//SYSUT1    DD DSN=&&PRFDATA,DISP=SHR
//SYSUT2    DD SYSOUT=*
//SYSIN     DD DUMMY
//SYSPRINT  DD SYSOUT=*
//*
//STEP2   EXEC PGM=IEBGENER
//SYSUT1    DD *
DATE TIME JOBNAME TCBTIME SRBTIME ASSTIME
/*
//          DD DSN=&&PRFDATA,DISP=SHR
//SYSUT2    DD DSN=&&FSEQ,DISP=(,CATLG,DELETE)
//SYSPRINT  DD SYSOUT=*
//SYSIN     DD DUMMY
//STEP3   EXEC PGM=IKJEFT01,PARM='JSONIFY henrimbp15/perfpost 5000'
//SYSEXEC   DD DSN=ZDO.INST.REXX,DISP=SHR
//SEQFILE   DD DSN=&&FSEQ,DISP=SHR
//SYSTSPRT  DD  SYSOUT=*
//SYSTSIN   DD  DUMMY
